driver-tests/bpelse/assign/AssignJbi/test/CopypositiveIntegerInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:DataType">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
   <positiveIntegerPart>
	<xsd_positiveInteger>1</xsd_positiveInteger>
	<optional_positiveInteger>1000</optional_positiveInteger>
	<repeat_positiveInteger>1000</repeat_positiveInteger>
	<repeat_positiveInteger>20</repeat_positiveInteger>
   </positiveIntegerPart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
